In [1]:
import pandas as pd

In [2]:
ratings_df = pd.read_csv('datasets/ml-25m/ratings.csv')
ratings_df.sample(2)

          userId  movieId  rating   timestamp
2931672    19327      434     5.0   835459504
12349078   79967    84954     2.0  1480815245

In [3]:
links = pd.read_csv('datasets/ml-25m/links.csv')
links.sample(1)

       movieId   imdbId    tmdbId
50174   180427  5716380  426260.0

Replace rating's movieId with the tmdbId and drop NA

In [4]:
ratings = ratings_df.merge(links, on='movieId', how='left').drop(['imdbId', 'movieId'], axis=1)
ratings.dropna(subset=['tmdbId'], inplace=True)
ratings['tmdbId'] = ratings['tmdbId'].astype(int)
ratings = ratings[['userId', 'tmdbId', 'rating','timestamp']]
ratings.sample(2)

          userId  tmdbId  rating   timestamp
14283833   92493   13853     2.0  1038113713
10121474   65658     161     4.5  1156164052

In [5]:
movies = pd.read_csv("datasets/mine/top_voted_movies.csv")
movies.sample(1)

,adult,backdrop_path,id,original_language,overview,popularity,poster_path,release_date,title,vote_average,vote_count,genres,year,imdb_id,revenue,production_companies,cast,director,tagline,keywords
4708,False,/iHc14vucwUMl6WuvQa4iPfoEdy9.jpg,799546,en,A successful woman in New York City finds her ...,25.535,/e0vrbTmTf2ZcW5CIS9qJ8FDbsU9.jpg,2022-09-30,Luckiest Girl Alive,6.6,702,"['Drama', 'Thriller', 'Mystery']",2022,tt4595186,0,"['Orchard Farm Productions', 'Made Up Stories'...","[{'name': 'Mila Kunis', 'character': 'Ani Fane...",Mike Barker,NaN,[]

Remove ratings that are not in my movies

In [6]:
ratings = ratings[ratings['tmdbId'].isin(movies['id'])]

In [8]:
ratings.sample(1)

          userId  tmdbId  rating  timestamp
21125705  137285     782     3.0  966576816

In [7]:
ratings.to_csv('datasets/ml-25m/ratings_tmdb.csv', index=False)